Scraper Documentation Improved
